#+TITLE: Conformance Progress
#+PROPERTY: header-args:sql-mode :product postgres :noweb yes :comments off

* Output stable_conformance_progress to json
  We can do this with a psql script.  We turn off alignment and turn on tuples (to remove the header and just have it as pure json) then output it to a file.  easy peasy!

  #+begin_src shell
  pwd
  #+end_src

  #+RESULTS:
  #+begin_example
  /home/zz/snoop/reports
  #+end_example

#+begin_src sql-mode :tangle progress-to-json.sql
  begin;
  \t
  \a
  \o ../resources/coverage/conformance-progress.json
    select json_agg(json_build_object(
    'release', release,
    'total', json_build_object(
      'endpoints', total_endpoints,
      'tested', total_tested_endpoints,
      'new', new_endpoints,
      'new_with_tests', new_endpoints_promoted_with_tests,
      'new_tested', new_endpoints_covered_by_new_tests + new_endpoints_covered_by_old_tests,
      'still_untested', endpoints_still_untested_today
    )
   ))from stable_conformance_progress;
  \o
  \a
  \t
  commit;
#+end_src

#+RESULTS:
#+begin_SRC example
BEGIN
Tuples only is on.
Output format is unaligned.
#+end_SRC

That will look now like so
#+begin_src shell
  cat progress2.json | jq .
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "release": "1.8.0",
    "total": {
      "endpoints": 273,
      "tested": 36,
      "new": 273,
      "new_with_tests": 36,
      "new_tested": 36,
      "still_untested": 183
    }
  },
  {
    "release": "1.9.0",
    "total": {
      "endpoints": 336,
      "tested": 68,
      "new": 63,
      "new_with_tests": 10,
      "new_tested": 14,
      "still_untested": 46
    }
  },
  {
    "release": "1.10.0",
    "total": {
      "endpoints": 345,
      "tested": 72,
      "new": 9,
      "new_with_tests": 0,
      "new_tested": 4,
      "still_untested": 5
    }
  },
  {
    "release": "1.11.0",
    "total": {
      "endpoints": 347,
      "tested": 72,
      "new": 2,
      "new_with_tests": 0,
      "new_tested": 0,
      "still_untested": 2
    }
  },
  {
    "release": "1.12.0",
    "total": {
      "endpoints": 348,
      "tested": 72,
      "new": 1,
      "new_with_tests": 0,
      "new_tested": 0,
      "still_untested": 1
    }
  },
  {
    "release": "1.13.0",
    "total": {
      "endpoints": 348,
      "tested": 73,
      "new": 0,
      "new_with_tests": 0,
      "new_tested": 0,
      "still_untested": 0
    }
  },
  {
    "release": "1.14.0",
    "total": {
      "endpoints": 366,
      "tested": 75,
      "new": 18,
      "new_with_tests": 0,
      "new_tested": 2,
      "still_untested": 9
    }
  },
  {
    "release": "1.15.0",
    "total": {
      "endpoints": 366,
      "tested": 82,
      "new": 0,
      "new_with_tests": 0,
      "new_tested": 0,
      "still_untested": 0
    }
  },
  {
    "release": "1.16.0",
    "total": {
      "endpoints": 394,
      "tested": 121,
      "new": 28,
      "new_with_tests": 26,
      "new_tested": 26,
      "still_untested": 2
    }
  },
  {
    "release": "1.17.0",
    "total": {
      "endpoints": 402,
      "tested": 128,
      "new": 8,
      "new_with_tests": 0,
      "new_tested": 0,
      "still_untested": 8
    }
  },
  {
    "release": "1.18.0",
    "total": {
      "endpoints": 409,
      "tested": 137,
      "new": 7,
      "new_with_tests": 0,
      "new_tested": 0,
      "still_untested": 7
    }
  },
  {
    "release": "1.19.0",
    "total": {
      "endpoints": 423,
      "tested": 160,
      "new": 14,
      "new_with_tests": 14,
      "new_tested": 14,
      "still_untested": 0
    }
  }
]
#+end_example

easy peasy!

Next up is visualizing this in a nice set of bar charts.  I'll cover that in a clojure/vega-lite function outside of this report.

* see which tests hit which endoints
#+begin_src sql-mode
  select
  endpoint,
  test.testname,
  test.file,
  test.release
  from       stable_endpoint_first
  left  join audit_event using(endpoint)
  inner join test on (test.codename = audit_event.test)
     where first_release = '1.19.0'
  order by endpoint
   ;
#+end_src

#+RESULTS:
#+begin_SRC example
                        endpoint                         |                 testname                 |                file                 | release
---------------------------------------------------------+------------------------------------------+-------------------------------------+---------
 createCertificatesV1CertificateSigningRequest           | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 createCertificatesV1CertificateSigningRequest           | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 createCertificatesV1CertificateSigningRequest           | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 deleteCertificatesV1CertificateSigningRequest           | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 deleteCertificatesV1CollectionCertificateSigningRequest | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 getCertificatesV1APIResources                           | aggregator-supports-the-sample-apiserver | test/e2e/apimachinery/aggregator.go | 1.8.0
 getCertificatesV1APIResources                           | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 listCertificatesV1CertificateSigningRequest             | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 listCertificatesV1CertificateSigningRequest             | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 listCertificatesV1CertificateSigningRequest             | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 listCertificatesV1CertificateSigningRequest             | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 listCertificatesV1CertificateSigningRequest             | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 patchCertificatesV1CertificateSigningRequest            | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 patchCertificatesV1CertificateSigningRequestApproval    | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 patchCertificatesV1CertificateSigningRequestStatus      | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 readCertificatesV1CertificateSigningRequest             | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 readCertificatesV1CertificateSigningRequest             | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 readCertificatesV1CertificateSigningRequestApproval     | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 readCertificatesV1CertificateSigningRequestStatus       | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 replaceCertificatesV1CertificateSigningRequest          | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 replaceCertificatesV1CertificateSigningRequestApproval  | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
 replaceCertificatesV1CertificateSigningRequestStatus    | CertificateSigningRequest API            | test/e2e/auth/certificates.go       | 1.19.0
(22 rows)

#+end_SRC

#+begin_src shell
  pwd
#+end_src

#+RESULTS:
#+begin_example
/home/zz/snoop/reports
#+end_example

